// =================================================================================
//  === task - 02 ================================================================
// ==========================================================================================
const total = 100;
let ordered = 50;
// ordered = 200;
if (total >= ordered) {
  console.log("Заказ оформлен, с вами свяжется менеджер");
} else {
  console.log("На складе недостаточно твоваров!");
}
// =========================================================================================
// === task-02 ============================================================================
// =========================================================================================
// const total = 100;
// let ordered = prompt("Введите количество желаемого товара!!!");
// if (total >= ordered) {
//   console.log("Заказ оформлен, с вами свяжется менеджер");
// } else {
//   console.log("На складе недостаточно твоваров!");
// }
