// ==============================================================================================
// ============================ task-03 ==================== с помощью тернарного сравнения =====
// ==============================================================================================
const ADMIN_PASSWORD = "11";
let message = prompt("Введите пароль");

if (message) {
  message === ADMIN_PASSWORD
    ? console.log("Добро пожаловать!")
    : console.log("Доступ запрещен, неверный пароль!");
} else {
  console.log("Отменено пользователем!");
}
